package main

import (
	"fmt"
	"lab2/task4/t4" // імпортуємо пакет t4
)

func main() {
	// Викликаємо функцію MinValue для знаходження мінімального значення серед чисел
	var min = t4.MinValue(0.1, -7, 2)
	fmt.Println("Мінімальне значення:", min)  // Виводимо мінімальне значення

	// Викликаємо функцію MeanValue для знаходження середнього значення чисел
	var mean = t4.MeanValue(14, 102, 501)
	fmt.Println("Середнє значення:", mean)  // Виводимо середнє значення

	// Викликаємо функцію EquationOfFist для знаходження рівняння першого порядку
	var eq = t4.EquationOfFist(6, 10, 5)
	fmt.Println("Рівняння першого порядку: y=kx+b. \ny=", eq)  // Виводимо рівняння
}
