package main

import "fmt"

func main() {
	// Змінна типу int8 для символу 'R'
	var chartype int8 = 'R'
	fmt.Printf("Code '%c' - %d\n", chartype, chartype) // Виведення коду символу 'R'

	// Завдання 1: Вивести українську літеру 'Ї'
	var ukrainianLetter rune = 'Ї' // Використання типу rune для символів Unicode
	fmt.Printf("Code '%c' - %U - %d\n", ukrainianLetter, ukrainianLetter, ukrainianLetter)

	// Пояснення призначення типу "rune"
	/*
		Тип "rune" — це псевдонім для типу int32.
		Він використовується для збереження одного символу в форматі Unicode.
		Завдяки типу rune можна працювати не лише з англійськими символами ASCII, 
		але й з символами інших мов та спеціальними знаками, що використовують коди Unicode.

		Наприклад, символ 'Ї' має Unicode-код 0x0407, який можна представити як ціле число.
		Таким чином, "rune" дозволяє обробляти символи з різними кодовими значеннями.
	*/
}
